<a href="https://colab.research.google.com/github/QiyuLiu21/L04/blob/master/Wrangle2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
missing_values = ["n/a","na","--"]
df = pd.read_csv('https://raw.githubusercontent.com/cunylaguardiadataanalytics/datasets/master/property.csv')

In [ ]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [ ]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [ ]:
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [ ]:
missing_values = ["n/a","na","--"]
df=pd.read_csv('https://raw.githubusercontent.com/cunylaguardiadataanalytics/datasets/master/property.csv',na_values=missing_values)

In [ ]:
df['NUM_BATH'] = pd.to_numeric(df['NUM_BATH'],errors='coerce')

In [ ]:
df['ST_NUM'].fillna(125,inplace=True)

In [ ]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0       1.5     NaN
2  100003000.0   125.0  LEXINGTON            N           NaN       1.0   850.0
3  100004000.0   201.0   BERKELEY           12           1.0       NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0       2.0  1600.0

In [ ]:
df.loc[2,'ST_NUM']=125
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0       1.5     NaN
2  100003000.0   125.0  LEXINGTON            N           NaN       1.0   850.0
3  100004000.0   201.0   BERKELEY           12           1.0       NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0       2.0  1600.0

In [ ]:
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)

In [ ]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0       1.5     NaN
2  100003000.0   125.0  LEXINGTON            N           2.5       1.0   850.0
3  100004000.0   201.0   BERKELEY           12           1.0       NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0       2.0  1600.0